src/app/controllers/database_controller.rb

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."username" = $1  [["username", "a"]]
INSERT INTO "user_settings" ("settings", "created_at", "updated_at", "username", "friends", "contests", "handle") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "user_settings" SET "handle" = $1, "updated_at" = $2 WHERE "user_settings"."id" = $3  [["handle", "nakamura"], ["updated_at", "2018-06-25 22:52:58.616814"], ["id", 1]]
---
	def update_handle_to_db
		to_add = params[:name].to_s
		user_exists = false
		@return = false

		if !validate(to_add, "handle")
			render plain: @return.inspect
			return
		end

		to_add = validate(to_add, "handle")

		for lines in UserSetting.where(username: current_user.username)
			user_exists = true
			lines.handle = to_add
			lines.save
		end
		if !user_exists
			new_entry = UserSetting.create(:settings => [], :username => current_user.username, :friends => [], :contests => [], :handle => to_add.to_s)
			new_entry.save

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."username" = $1  [["username", "a"]]
UPDATE "user_settings" SET "settings" = $1, "updated_at" = $2 WHERE "user_settings"."id" = $3  [["settings", "---\n- 1A\n"], ["updated_at", "2018-06-25 19:19:50.252765"], ["id", 1]]
---
	def add_links_to_db
		to_add = params[:name].to_s
		user_exists = false
		@return = false

		if !validate(to_add, "problem")
			render plain: @return.inspect
			return
		end

		for lines in UserSetting.where(username: current_user.username)
			user_exists = true
			all_links = lines.settings
			if !(all_links.include? to_add)
				lines.settings << to_add
				@return = true
				lines.save

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."username" = $1  [["username", "a"]]
UPDATE "user_settings" SET "settings" = $1, "updated_at" = $2 WHERE "user_settings"."id" = $3  [["settings", "--- []\n"], ["updated_at", "2018-06-25 19:31:50.698352"], ["id", 1]]
---
	def remove_links_from_db
		to_delete = params[:name].to_s
		@return = false
		for lines in UserSetting.where(username: current_user.username)
			all_links = lines.settings
			if all_links.include? to_delete
				lines.settings.delete(to_delete)
				lines.save

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."username" = $1  [["username", "a"]]
---
	def add_friends_to_db
		user_exists = false
		to_add = params[:name].to_s
		@return = false

		if !validate(to_add, "handle")
			render plain: @return.inspect
			return
		end

		to_add = validate(to_add, "handle")

		for lines in UserSetting.where(username: current_user.username)

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."username" = $1  [["username", "a"]]
---
	def remove_friends_from_db
		to_delete = params[:name].to_s
		to_delete = validate(to_delete, "handle")
		@return = "false"
		for lines in UserSetting.where(username: current_user.username)

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."username" = $1  [["username", "a"]]
---
	def add_contest_to_db
		user_exists = false
		to_add = params[:name].to_s
		@return = false

		if !validate(to_add, "contest")
			render plain: @return.inspect
			return
		end

		for lines in UserSetting.where(username: current_user.username)

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."username" = $1  [["username", "a"]]
---
	def remove_contest_from_db
		to_delete = params[:name].to_s
		@return = false
		for lines in UserSetting.where(username: current_user.username)