src/app/controllers/pages_controller.rb

	def profile
		if user_signed_in?
			db_entry = UserSetting.where(username: current_user.username)[0]
---
SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."username" = $1  [["username", "a"]]

	def test
		db_entry = UserInformation.where(handle: "PedroBortolli")[0]
		if db_entry == nil
			puts("Tem nao. Bora criar :)")
			UserInformation.create(:handle => "PedroBortolli", :info => {"Eae": "Men"})
---
SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."handle" = $1  [["handle", "PedroBortolli"]]
INSERT INTO "user_informations" ("handle", "info", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["handle", "PedroBortolli"], ["info", "---\n:Eae: Men\n"], ["created_at", "2018-07-09 20:15:02.145848"], ["updated_at", "2018-07-09 20:15:02.145848"]]