src/app/views/pages/profile.html.erb

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."username" = $1  [["username", "a"]]
---

	<% for user in UserSetting.where(username: current_user.username) %>