src/app/views/pages/test.html.erb

SELECT "user_settings".* FROM "user_settings"
---
<body class = "background centered">
	<% for user in UserSetting.all %>

SELECT "user_informations".* FROM "user_informations"
---
	<br/>
	<% for entry in UserInformation.all %>